# Pandas Practice Exercises

This notebook contains 40+ exercises to practice your Pandas skills. The exercises start from the basics and gradually increase in difficulty.

## Datasets Used
We will use a few common datasets available online. You can load them directly using the URLs provided in the exercises.
1. **Chipotle**: `https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv`
2. **Drinks**: `https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv`
3. **Titanic**: `https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv`

---

## Section 1: Getting Started & Basic Data Structures

In [1]:
# 1. Import pandas as pd and numpy as np
import pandas as pd
import numpy as np

In [2]:
# 2. Print the version of pandas that has been imported.
print(pd.__version__)

2.3.3

In [3]:
# 3. Create a pandas Series from the following list:
data = [10, 20, 30, 40, 50]
# Your code here
s=pd.Series(data)
display(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
# 4. Create a DataFrame from the following dictionary:
data_dict = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
# Your code here
frame=pd.DataFrame(data_dict)
display(frame)

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [5]:
# 5. Set the 'name' column as the index of the DataFrame created in Q4.
idxframe=frame.set_index('name')
display(idxframe)

         age         city
name
Alice     25     New York
Bob       30  Los Angeles
Charlie   35      Chicago
David     40      Houston

---
## Section 2: Loading Data & Basic Exploration
For this section, we will use the **Chipotle** dataset.
URL: `https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv`
*Note: This file is tab-separated.*

In [6]:
# 6. Load the dataset into a variable called `chipo`.
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
# Your code here
chipo=pd.read_csv(url,sep='\t')

In [7]:
# 7. Show the first 10 entries of the dataframe.
display(chipo.head(10))

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [8]:
# 8. What is the number of observations (rows) and columns in the dataset?
print(chipo.shape)

(4622, 5)

In [9]:
# 9. Print the name of all the columns.
print(chipo.columns)

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [10]:
# 10. How is the dataset indexed?
print(chipo.index)

RangeIndex(start=0, stop=4622, step=1)

---
## Section 3: Data Cleaning & Manipulation
Continue using the `chipo` dataframe.

In [11]:
# 11. Check the data type of each column.
print(chipo.info)

<bound method DataFrame.info of       order_id  quantity                              item_name  \
0            1         1           Chips and Fresh Tomato Salsa
1            1         1                                   Izze
2            1         1                       Nantucket Nectar
3            1         1  Chips and Tomatillo-Green Chili Salsa
4            2         2                           Chicken Bowl
...        ...       ...                                    ...
4617      1833         1                          Steak Burrito
4618      1833         1                          Steak Burrito
4619      1834         1                     Chicken Salad Bowl
4620      1834         1                     Chicken Salad Bowl
4621      1834         1                     Chicken Salad Bowl

                                     choice_description item_price
0                                                   NaN     $2.39
1                                          [Clementine]     $3.39
2                                               [Apple]     $3.39
3                                                   NaN     $2.39
4     [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98
...                                                 ...        ...
4617  [Fresh Tomato Salsa, [Rice, Black Beans, Sour ...    $11.75
4618  [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...    $11.75
4619  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...    $11.25
4620  [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...     $8.75
4621  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...     $8.75

[4622 rows x 5 columns]>

In [12]:
# 12. The 'item_price' column is currently an object (string) because of the '$' sign.
# Clean this column: remove the '$' and convert it to a float.
chipo['item_price'] = chipo['item_price'].str.replace('$', '', regex=False).astype(float)
display(chipo.head())

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [13]:
# 13. Are there any missing values in the dataset? Check for nulls.
print(chipo.isnull().sum())

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

In [14]:
# 14. Drop any duplicate rows, if they exist.
chipo.drop_duplicates(inplace=True)
display(chipo.head())

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [15]:
# 15. Create a new column 'revenue' which is the product of 'quantity' and 'item_price'.
chipo['revenue'] = chipo['quantity'] * chipo['item_price']
display(chipo.head())

,order_id,quantity,item_name,choice_description,item_price,revenue
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

---
## Section 4: Filtering & Sorting

In [16]:
# 16. Sort the dataframe by 'item_price' in descending order.
display(chipo.sort_values(by='item_price', ascending=False).head())

,order_id,quantity,item_name,choice_description,item_price,revenue
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25,663.75
3480,1398,3,Carnitas Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",35.25,105.75
3602,1443,4,Chicken Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",35.00,140.00
1254,511,4,Chicken Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",35.00,140.00
3601,1443,3,Veggie Burrito,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",33.75,101.25

In [17]:
# 17. How many items cost more than $10.00?
cnt=chipo[chipo['item_price']>10.00]
print(f"{cnt} items cost more than $10.00")

      order_id  quantity           item_name  \
4            2         2        Chicken Bowl
5            3         1        Chicken Bowl
7            4         1       Steak Burrito
13           7         1        Chicken Bowl
23          12         1     Chicken Burrito
...        ...       ...                 ...
4610      1830         1       Steak Burrito
4611      1830         1      Veggie Burrito
4617      1833         1       Steak Burrito
4618      1833         1       Steak Burrito
4619      1834         1  Chicken Salad Bowl

                                     choice_description  item_price  revenue
4     [Tomatillo-Red Chili Salsa (Hot), [Black Beans...       16.98    33.96
5     [Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...       10.98    10.98
7     [Tomatillo Red Chili Salsa, [Fajita Vegetables...       11.75    11.75
13    [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...       11.25    11.25
23    [[Tomatillo-Green Chili Salsa (Medium), Tomati...       10.98    10.98
...                                                 ...         ...      ...
4610  [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...       11.75    11.75
4611  [Tomatillo Green Chili Salsa, [Rice, Fajita Ve...       11.25    11.25
4617  [Fresh Tomato Salsa, [Rice, Black Beans, Sour ...       11.75    11.75
4618  [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...       11.75    11.75
4619  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...       11.25    11.25

[1123 rows x 6 columns] items cost more than $10.00

In [18]:
# 18. What is the price of each item?
# (Hint: print a dataframe with only two columns: item_name and item_price, drop duplicates)
item_prices = chipo[['item_name', 'item_price']].drop_duplicates()
display(item_prices.sort_values(by='item_price', ascending=False).head())

                         item_name  item_price
3598  Chips and Fresh Tomato Salsa       44.25
3480                 Carnitas Bowl       35.25
1254               Chicken Burrito       35.00
3601                Veggie Burrito       33.75
409                   Chicken Bowl       32.94

In [19]:
# 19. Select only the items where the name is 'Chicken Bowl'.
chicken_bowls = chipo[chipo['item_name'] == 'Chicken Bowl']
display(chicken_bowls.head())

,order_id,quantity,item_name,choice_description,item_price,revenue
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98,10.98
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
19,10,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",8.75,8.75
26,13,1,Chicken Bowl,"[Roasted Chili Corn Salsa (Medium), [Pinto Bea...",8.49,8.49

In [20]:
# 20. Select items where the name is 'Chicken Bowl' AND the quantity is greater than 1.
chicken_bowls_multiple = chipo[(chipo['item_name'] == 'Chicken Bowl') & (chipo['quantity'] > 1)]
display(chicken_bowls_multiple.head())

,order_id,quantity,item_name,choice_description,item_price,revenue
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96
154,70,2,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",17.50,35.00
282,124,2,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",17.50,35.00
409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",32.94,98.82
415,181,2,Chicken Bowl,[Tomatillo Red Chili Salsa],17.50,35.00

---
## Section 5: Aggregation & Grouping
For this section, we will use the **Drinks** dataset.
URL: `https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv`

In [21]:
# 21. Load the drinks dataset into a variable called `drinks`.
url_drinks = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'
# Your code here
drinks=pd.read_csv(url_drinks)

In [22]:
# 22. Which continent drinks more beer on average?
most_beer_continent = drinks.groupby('continent')['beer_servings'].mean().idxmax()
print(f"The continent that drinks more beer on average is: {most_beer_continent}")

The continent that drinks more beer on average is: EU

In [23]:
# 23. For each continent, print the statistics for wine consumption.
wine_continent = drinks.groupby('continent')['wine_servings'].describe()
display(wine_continent)

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [24]:
# 24. Print the mean alcohol consumption per continent for every column.
mean_alcohol_consumption = drinks.groupby('continent')[['beer_servings', 'spirit_servings', 'wine_servings']].mean()
display(mean_alcohol_consumption)

           beer_servings  spirit_servings  wine_servings
continent
AF             61.471698        16.339623      16.264151
AS             37.045455        60.840909       9.068182
EU            193.777778       132.555556     142.222222
OC             89.687500        58.437500      35.625000
SA            175.083333       114.750000      62.416667

In [25]:
# 25. Print the median alcohol consumption per continent for every column.
median_alcohol_consumption = drinks.groupby('continent')[['beer_servings', 'spirit_servings', 'wine_servings']].median()
display(median_alcohol_consumption)

           beer_servings  spirit_servings  wine_servings
continent
AF                  32.0              3.0            2.0
AS                  17.5             16.0            1.0
EU                 219.0            122.0          128.0
OC                  52.5             37.0            8.5
SA                 162.5            108.5           12.0

---
## Section 6: Apply & Advanced Selection
Back to the `chipo` dataset

In [26]:
# 26. Create a function that returns "High" if a price is > 10 and "Low" otherwise.
# Apply this function to the 'item_price' column of `chipo` and create a new column 'price_level'.
def get_price_level(price):
    return "High" if price > 10 else "Low"

chipo['price_level'] = chipo['item_price'].apply(get_price_level)
display(chipo.head())

,order_id,quantity,item_name,choice_description,item_price,revenue,price_level
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39,Low
1,1,1,Izze,[Clementine],3.39,3.39,Low
2,1,1,Nantucket Nectar,[Apple],3.39,3.39,Low
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39,Low
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96,High

In [27]:
# 27. Use the `apply` method to capitalize all strings in the 'item_name' column.
chipo['item_name'] = chipo['item_name'].apply(lambda x: x.upper())
display(chipo.head())

,order_id,quantity,item_name,choice_description,item_price,revenue,price_level
0,1,1,CHIPS AND FRESH TOMATO SALSA,NaN,2.39,2.39,Low
1,1,1,IZZE,[Clementine],3.39,3.39,Low
2,1,1,NANTUCKET NECTAR,[Apple],3.39,3.39,Low
3,1,1,CHIPS AND TOMATILLO-GREEN CHILI SALSA,NaN,2.39,2.39,Low
4,2,2,CHICKEN BOWL,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96,High

In [28]:
# 28. Select only the rows from index 10 to 20 (inclusive) and columns 1 to 3.
selected_data = chipo.iloc[10:21, 1:4]
display(selected_data)

,quantity,item_name,choice_description
10,1,CHIPS AND GUACAMOLE,NaN
11,1,CHICKEN CRISPY TACOS,"[Roasted Chili Corn Salsa, [Fajita Vegetables,..."
12,1,CHICKEN SOFT TACOS,"[Roasted Chili Corn Salsa, [Rice, Black Beans,..."
13,1,CHICKEN BOWL,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,..."
14,1,CHIPS AND GUACAMOLE,NaN
15,1,CHIPS AND TOMATILLO-GREEN CHILI SALSA,NaN
16,1,CHICKEN BURRITO,"[Tomatillo-Green Chili Salsa (Medium), [Pinto ..."
17,1,CHICKEN BURRITO,"[Fresh Tomato Salsa (Mild), [Black Beans, Rice..."
18,2,CANNED SODA,[Sprite]
19,1,CHICKEN BOWL,"[Tomatillo Red Chili Salsa, [Fajita Vegetables..."
20,1,CHIPS AND GUACAMOLE,NaN

---
## Section 7: Merging & Joining

In [29]:
# 29. Create two dataframes:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 95]})

# Merge them on 'ID' using an inner join.
merged_inner = pd.merge(df1, df2, on='ID', how='inner')
display(merged_inner)

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90

In [30]:
# 30. Merge them on 'ID' using an outer join.
merged_outer = pd.merge(df1, df2, on='ID', how='outer')
display(merged_outer)

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0
3   4      NaN   95.0

In [31]:
# 31. Merge them on 'ID' using a left join (keep all from df1).
merged_left = pd.merge(df1, df2, on='ID', how='left')
display(merged_left)

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0

---
## Section 8: Time Series
For this section, let's generate some time series data.

In [32]:
# 32. Create a date range from '2023-01-01' to '2023-01-10'.
date_range = pd.date_range(start='2023-01-01', end='2023-01-10')
print(date_range)

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

In [33]:
# 33. Create a DataFrame with this date range as the index and a column 'Sales' with random values.
df_time_series = pd.DataFrame({
    'Sales': np.random.randint(50, 150, size=len(date_range))
}, index=date_range)
display(df_time_series)

            Sales
2023-01-01    108
2023-01-02    122
2023-01-03    112
2023-01-04    114
2023-01-05    120
2023-01-06     62
2023-01-07     56
2023-01-08     69
2023-01-09     66
2023-01-10    114

In [34]:
# 34. Resample the data to calculate the 3-day sum of sales.
resampled_sales = df_time_series['Sales'].resample('3D').sum()
display(resampled_sales)

2023-01-01    342
2023-01-04    296
2023-01-07    191
2023-01-10    114
Freq: 3D, Name: Sales, dtype: int32

In [35]:
# 35. Shift the 'Sales' column by 1 day (create a lag column).
df_time_series['Sales_Lag1'] = df_time_series['Sales'].shift(1)
display(df_time_series)

            Sales  Sales_Lag1
2023-01-01    108         NaN
2023-01-02    122       108.0
2023-01-03    112       122.0
2023-01-04    114       112.0
2023-01-05    120       114.0
2023-01-06     62       120.0
2023-01-07     56        62.0
2023-01-08     69        56.0
2023-01-09     66        69.0
2023-01-10    114        66.0

---
## Section 9: Titanic Dataset - Mixed Practice
URL: `https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv`

In [36]:
# 36. Load the Titanic dataset.
url_titanic = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'
# Your code here
tit=pd.read_csv(url_titanic)

In [37]:
# 37. How many passengers survived? (Survived=1)
survived_count = tit['Survived'].sum()
print(f"Number of passengers who survived: {survived_count}")

Number of passengers who survived: 342

In [38]:
# 38. What is the average age of passengers?
average_age = tit['Age'].mean()
print(f"Average age of passengers: {average_age:.2f}")

Average age of passengers: 29.70

In [39]:
# 39. Group by 'Pclass' and calculate the survival rate (mean of 'Survived').
survival_rate_by_pclass = tit.groupby('Pclass')['Survived'].mean()
survival_rate_by_pclass

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [40]:
# 40. Fill missing values in the 'Age' column with the median age.
median_age = tit['Age'].median()
tit['Age'].fillna(median_age, inplace=True)
print(f"Missing 'Age' values after filling: {tit['Age'].isnull().sum()}")
display(tit.head())

Missing 'Age' values after filling: 0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [41]:
# 41. Create a pivot table showing the average age by 'Sex' and 'Pclass'.
pivot_table_age = tit.pivot_table(values='Age', index='Sex', columns='Pclass', aggfunc='mean')
display(pivot_table_age)

Pclass          1          2          3
Sex
female  33.978723  28.703947  23.572917
male    38.995246  30.512315  26.911873

---
## Section 10: Visualization (Optional)
Requires matplotlib/seaborn

In [42]:
# 42. Plot a histogram of the 'Age' column from the Titanic dataset.

In [43]:
# 43. Plot a bar chart of the average fare by Pclass.

---
## Great Job!
You've covered the basics of Pandas including creating objects, reading data, cleaning, filtering, grouping, merging, and time series.